<?php

use Illuminate\Database\Seeder;
use Illuminate\Database\Eloquent\Model;

class ProductionSeeder extends Seeder {

    /**
     * Run the database seeds.
     *
     * @return void
     */
    protected $config = [];
    public function run()
    {
        Model::unguard();
        collect(['make_config', 'insert_category', 'insert_club'])->map(function($m){
                $t = time();
                $this->$m();
                $this->command->info(sprintf("%20s:%5d seconds", $m, time()-$t ));
            });
    }
    public function insert_category(){
        \DB::table('categories')->truncate();
        $ids = [ 0, 0, 0, 0];
        foreach($this->config['cates'] as $i => $t){
            $name = str_replace('-', '', $t);
            $level = strlen($t) - strlen($name);
            $ids[$level] = $i + 1;
            \App\Category::create(['id' => $i + 1, 'level' => $level, 'name' => $name, 'parent_id' => $ids[$level-1], 'cover_image_id' => $i + 1 ]);
        }
        \App\Category::chunk(200, function($items){
            \DB::beginTransaction();
            foreach($items as $item){
                $is_leaf = \App\Category::where('parent_id', $item->id)->count() > 0 ? 0 : 1;
                $item->is_leaf = $is_leaf;
                $item->save();
            }
            \DB::commit();
        });
    }

    public function insert_club(){
        \DB::table('clubs')->truncate();
        \DB::table('cover_images')->truncate();
        foreach($this->config['clubs'] as $name => $desc){
            $ci = \App\CoverImage::create(['ext' => 'jpg',
                'filename' => date("YmdHis")."_club_".rand(1000,9999), 
                ]);
            \App\Club::create(['name' => $name, 'brief' => $desc, 'cover_image_id' => $ci->id ]);
        }

    }
    public function make_config(){
        $this->config['cates'] = [
'-教案',
'--大班',
'---语言',
'---美工',
'---数学',
'---科学',
'---音乐',
'---健康',
'--中班',
'---语言',
'---美工',
'---数学',
'---科学',
'---音乐',
'---健康',
'--小班',
'---语言',
'---美工',
'---数学',
'---科学',
'---音乐',
'---健康',
'--托班',
'---语言',
'---美工',
'---数学',
'---科学',
'---音乐',
'---健康',
'-计划',
'--大班',
'---班务',
'---学期',
'---个人',
'---教学',
'--中班',
'---班务',
'---学期',
'---个人',
'---教学',
'--小班',
'---班务',
'---学期',
'---个人',
'---教学',
'--托班',
'---班务',
'---学期',
'---个人',
'---教学',
'-总结',
'--大班',
'---班务',
'---学期',
'---个人',
'---年终',
'--中班',
'---班务',
'---学期',
'---个人',
'---年终',
'--小班',
'---班务',
'---学期',
'---个人',
'---年终',
'--托班',
'---班务',
'---学期',
'---个人',
'---年终',
'-专业成长',
'--大班',
'---说课评课',
'---反思',
'---随笔',
'---个案分析',
'---观察记录',
'---幼儿评语',
'--中班',
'---说课评课',
'---反思',
'---随笔',
'---个案分析',
'---观察记录',
'---幼儿评语',
'--小班',
'---说课评课',
'---反思',
'---随笔',
'---个案分析',
'---观察记录',
'---幼儿评语',
'--托班',
'---说课评课',
'---反思',
'---随笔',
'---个案分析',
'---观察记录',
'---幼儿评语',
'-玩教具',
'--DIY',
'---泥工',
'---废旧材料',
'---纸质',
'---编织',
'---布艺',
'---户外',
'--成品',
'-环境创设',
'--盥洗室',
'--卫生间',
'--活动室墙面',
'--楼梯走廊',
'--家园栏',
'--吊饰',
'--户外环境',
'-活动区',
'--大班',
'---角色区',
'---语言区',
'---建筑区',
'---益智区',
'---美工区',
'---科学区',
'---互动墙',
'--中班',
'---角色区',
'---语言区',
'---建筑区',
'---益智区',
'---美工区',
'---科学区',
'---互动墙',
'--小班',
'---角色区',
'---语言区',
'---建筑区',
'---益智区',
'---美工区',
'---科学区',
'---互动墙',
'--托班',
'---角色区',
'---语言区',
'---建筑区',
'---益智区',
'---美工区',
'---科学区',
'---互动墙',
'-主题墙',
'--大班',
'---节日',
'---季节',
'---交通',
'---生成主题',
'--中班',
'---节日',
'---季节',
'---交通',
'---生成主题',
'--小班',
'---节日',
'---季节',
'---交通',
'---生成主题',
'--托班',
'---节日',
'---季节',
'---交通',
'---生成主题',
'-素材资源',
'--人文景观',
'--生活百科',
'--宇宙探索',
'--地球漫谈',
'--动物',
'--植物',
'--人体奥秘',
'-幼教图库',
'--简笔画',
'--节日',
'--线描',
'--铅笔',
'--水粉',
'--手工粘贴',
'-家园共育',
'--家长沟通',
'--心理特点',
'--幼小衔接',
'--入园准备',
'--保健知识',
'--科学饮食',
'-园长之窗',
'--队伍建设',
'--管理策略',
'--园务工作',
'--园长研修',
'-儿歌故事',
'--儿歌',
'--绕口令',
'--诗歌',
'--英文儿歌',
'--故事',
'-游戏',
'--室内',
'--室外',
'--亲子',
'--手指游戏',
'-特色课程',
'--思维游戏',
'--全景数学',
'--奥尔夫',
'--蒙台梭利',
'--英语',
            ];
        $this->config['clubs'] = [
'爱上瓶盖儿手工' => '小小的材料，大大的创意，一起DIY各种废瓶盖废瓶塞，教你如何变废为宝！',
'新手幼师充电站' => '作为一名年轻老师，面对新的环境，一份饱含期待的工作，胸怀着满腔热情踏进幼儿园这片纯净的土地，然而工作的忙碌让大家感到不知所错，还等什么，来这里为自己充电吧！',
'不织布手工坊'   => '布艺手工制作，分享简单易学的不织布DIY教程、手工制作等图解教程',
'随手拍园所环境' => '见到什么美好的东西随手拍下来。想拍什么拍什么，自己的别人的都OK看兴致，看爱好，看心情，最快分享。',
'孩子们那些画儿' => '画画是简便的活动，无需特殊的物质条件，只要有纸张和笔（甚至沙土和小棍）就可以…',
'家长集中营'     => '家长对与幼儿园来说是一个特殊而庞大的群体，做好家长工作是幼儿园工作的重中之重，做好家长工作，使家长成为我们密切合作的伙伴。',
            ];
    }



    // us DB::statement($sql);
}
